Project/Toir/src/Documents/торо_УстановкаЦелевыхЗначенийПоказателейKPI/торо_УстановкаЦелевыхЗначенийПоказателейKPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_УстановкаЦелевыхЗначенийПоказателейKPI</name>
  <registerRecords>InformationRegister.торо_ЦелевыеЗначенияKPI</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КлючевыеПоказатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.торо_ПоказателиKPI</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КритическоеЗначениеПоказателя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателяОграниченоПоВремени</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Enums/торо_ТипыПоказателейKPI/торо_ТипыПоказателейKPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ТипыПоказателейKPI</name>
  <enumValues>
    <name>ПоказательОбъектаРемонта</name>
  </enumValues>
  <enumValues>
    <name>ПоказательПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ПоказательОрганизации</name>
  </enumValues>
  <enumValues>
    <name>гкс_ПоказательСлужбы</name>
  </enumValues>
  <enumValues>
    <name>гкс_ПоказательТипаРабот</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Documents/торо_УстановкаЦелевыхЗначенийПоказателейKPI/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ПравоРедактирования = ПравоДоступа("Редактирование", Метаданные.Документы.торо_УстановкаЦелевыхЗначенийПоказателейKPI);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьДополнительныеРеквизитыТаблицы();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	ИндексСтроки = 0;
	ШаблонСообщения = НСтр("es='En la línea %1 partes tabulares no es rellenado ni un de los campos ""la Organización"", ""la Subdivisión"", ""el Objeto de la reparación"".';ru='В строке %1 табличной части не заполнено ни одно из полей ""Организация"", ""Подразделение"", ""Объект ремонта"".';en='In the line%1 of the tabular part, none of the fields ""Organization"", ""Division"", ""Repair Object"" are filled.'");

	Для каждого Строка из Объект.КлючевыеПоказатели Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Организация) 
			И НЕ ЗначениеЗаполнено(Строка.Подразделение)
			И НЕ ЗначениеЗаполнено(Строка.ОбъектРемонта) Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ИндексСтроки+1);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.КлючевыеПоказатели["+ИндексСтроки+"].Организация",, Отказ);
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ЗапросДублей = Новый Запрос;
	ЗапросДублей.Текст =
	"ВЫБРАТЬ
	|	КлючевыеПоказатели.Показатель,
	|	КлючевыеПоказатели.Организация,
	|	КлючевыеПоказатели.Подразделение,
	|	КлючевыеПоказатели.ОбъектРемонта,
	|	1 КАК КоличествоСтрок
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	&КлючевыеПоказатели КАК КлючевыеПоказатели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Показатель,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Подразделение,
	|	ТаблицаДокумента.ОбъектРемонта,
	|	СУММА(ТаблицаДокумента.КоличествоСтрок) КАК КоличествоСтрок
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Показатель,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Подразделение,
	|	ТаблицаДокумента.ОбъектРемонта
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаДокумента.КоличествоСтрок) > 1";
	
	ЗапросДублей.УстановитьПараметр("КлючевыеПоказатели", Объект.КлючевыеПоказатели.Выгрузить());
	ВыборкаДублей = ЗапросДублей.Выполнить().Выбрать();
	
	ШаблонСообщения = НСтр("es='En la tabla son duplicadas las líneas con аналитикой: el Índice = ""el %1"", la Organización = ""el %2"", la Subdivisión = ""el %3"", el Objeto de la reparación = ""el %4"".';ru='В таблице дублируются строки с аналитикой: Показатель=""%1"", Организация=""%2"", Подразделение=""%3"", Объект ремонта=""%4"".';en='The table duplicates rows with analytics: Indicator = ""%1"", Organization = ""%2"", Department = ""%3"", Repair Object = ""%4"".'");
	Пока ВыборкаДублей.Следующий() Цикл
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыборкаДублей.Показатель, ВыборкаДублей.Организация, ВыборкаДублей.Подразделение, ВыборкаДублей.ОбъектРемонта);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаполнитьДополнительныеРеквизитыТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КлючевыеПоказателиПоказательПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.КлючевыеПоказатели.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьДополнительныеРеквизитыСтрокиТаблицы(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючевыеПоказателиПриИзменении(Элемент)
	
	текСтрока = Элементы.КлючевыеПоказатели.ТекущиеДанные;
	Если текСтрока <> Неопределено 
		И текСтрока.ЗначениеПоказателяОграниченоПоВремени = Ложь тогда
		текСтрока.ДатаПо = '00010101000000';
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ЗаполнитьДополнительныеРеквизитыТаблицы()
	
	Для каждого СтрокаТаблицы из Объект.КлючевыеПоказатели Цикл
		ЗаполнитьДополнительныеРеквизитыСтрокиТаблицы(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДополнительныеРеквизитыСтрокиТаблицы(СтрокаТаблицы)
	
	Если НЕ ПравоРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТипПоказателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.Показатель, "ТипПоказателя");
	СтрокаТаблицы.ДоступноПодразделение = (ТипПоказателя = ПредопределенноеЗначение("Перечисление.торо_ТипыПоказателейKPI.ПоказательПодразделения") 
														ИЛИ ТипПоказателя = ПредопределенноеЗначение("Перечисление.торо_ТипыПоказателейKPI.ПоказательОбъектаРемонта"));
	СтрокаТаблицы.ДоступенОР = (ТипПоказателя = ПредопределенноеЗначение("Перечисление.торо_ТипыПоказателейKPI.ПоказательОбъектаРемонта"));
	
	Если НЕ СтрокаТаблицы.ДоступноПодразделение Тогда
		СтрокаТаблицы.Подразделение = Неопределено;
	КонецЕсли;
	
	Если НЕ СтрокаТаблицы.ДоступенОР Тогда
		СтрокаТаблицы.ОбъектРемонта = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
